go_type_assertions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-27 Fri 01:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: Type Assertions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: Type Assertions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb5e2bd5">1. Type switch</a></li>
<li><a href="#org3ab52ea">2. Interface conversions and type assertions</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5e2bd5" class="outline-2">
<h2 id="orgb5e2bd5"><span class="section-number-2">1</span> Type switch</h2>
<div class="outline-text-2" id="text-1">
<p>
A switch can also be used to discover the dynamic type of an interface variable.  Such a type switch uses the syntax of a type assertion with the keyword type inside the parentheses. If the switch declares a variable in the expression, the variable will have the corresponding type in each clause. It's also idiomatic to reuse the name in such cases, in effect declaring a new variable with the same name but a different type in each case.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> t <span style="color: #00ff00; font-weight: bold;">interface</span>{}
t = <span style="color: #00ffff; font-weight: bold;">functionOfSomeType</span>()

<span style="color: #00ff00; font-weight: bold;">switch</span> t := t.(<span style="color: #00ff00; font-weight: bold;">type</span>) {
<span style="color: #00ff00; font-weight: bold;">default</span>:
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"unexpected type %T\n"</span>, t) <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">%T prints whatever type t has</span>
<span style="color: #00ff00; font-weight: bold;">case</span> bool:
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"boolean %t\n"</span>, t) <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">t has type bool</span>
<span style="color: #00ff00; font-weight: bold;">case</span> int:
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"integer %t\n"</span>, t) <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">t has type int</span>
<span style="color: #00ff00; font-weight: bold;">case</span> *bool:
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"pointer to boolean %t\n"</span>, t) <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">t has type *bool</span>
<span style="color: #00ff00; font-weight: bold;">case</span> *int:
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"pointer to integer %t\n"</span>, t) <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">t has type *intt</span>
}
</pre>
</div>
<p>
Type switches are a form of interface conversion: they take and interface and, for each case in the switch, in a sense convert it to the type of that case. The first case finds a concrete value; the second converts the interface into another interface. It's perfectly fine to mix types this way.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Stringer</span> <span style="color: #00ff00; font-weight: bold;">interface</span> {
        <span style="color: #00ffff; font-weight: bold;">String</span>() string
}

<span style="color: #00ff00; font-weight: bold;">var</span> value <span style="color: #00ff00; font-weight: bold;">interface</span>{} <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Value provided by caller.</span>
<span style="color: #00ff00; font-weight: bold;">switch</span> str := value.(<span style="color: #00ff00; font-weight: bold;">type</span>) {
<span style="color: #00ff00; font-weight: bold;">case</span> string:
        <span style="color: #00ff00; font-weight: bold;">return</span> str
<span style="color: #00ff00; font-weight: bold;">case</span> Stringer:
        <span style="color: #00ff00; font-weight: bold;">return</span> str.<span style="color: #00ffff; font-weight: bold;">String</span>()
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org3ab52ea" class="outline-2">
<h2 id="org3ab52ea"><span class="section-number-2">2</span> Interface conversions and type assertions</h2>
<div class="outline-text-2" id="text-2">
<p>
What if there's only one type we care about? If we know the value holds a string and we just want to extract it? A one-case type switch would do, but so would a type assertion. A type assertion takes an interface value and extracts from it a value of the specified explicit type. The syntax borrows from the clause opening a type switch, but with an explicit type rather than the type keyword and the result is a new value with the static type typeName. That type must either be the concrete type held by the interface, or a second interface type that the value can be converted to.
</p>
<div class="org-src-container">
<pre class="src src-go">value.(<span style="color: #00ffff;">typeName</span>)
<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">To extract the string we know is in the value, we could write:</span>
str := value.(<span style="color: #00ffff;">string</span>)
</pre>
</div>
<p>
But if it turns out that the value does not contain a string, the program will crash with a run-time error. To guard against that, use the "comma, ok" idiom to test, safely, whether the value is a string. If the type assertion fails, str will still exist and be of type string, but it will have the zero value, an empty string.
</p>
<div class="org-src-container">
<pre class="src src-go">str, ok := value.(<span style="color: #00ffff;">string</span>)
<span style="color: #00ff00; font-weight: bold;">if</span> ok {
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"string value is: %q\n"</span>, str)
} <span style="color: #00ff00; font-weight: bold;">else</span> {
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"value is not a string\n"</span>)
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-27 Fri 01:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
